/*
* 数组的扩展运算符：...
* 将一个数组转为用逗号分隔的参数序列。
*
*
* */
console.log(...[1,2,3,4,[5,6,7]]); //1,2,3,4,[5,6,7]
console.log([1,2,3,...[2,3,4],3]); //[1,2,3,2,3,4,4]

/*
* 替代函数的apply方法
* */
function f(x,y,z) {
    console.log(x,y,z)
}
var arr = [1,2,3];
f.apply(null,arr)
f(...arr)

/*
* 扩展运算符的应用
* */

//深拷贝
// 但是只适用于一维数组
var arr1 = [1,2,3,[4,5]];
var arr2 = [...arr1];
arr[1] = 3;
arr1[3][1] = 6;
console.log(arr2);

//和结构复制结合
//  如果将扩展运算符用于数组赋值，只能放在参数的最后一位，否则会报错。

//可以将字符串转化为字符数组
var str = 'hello';
console.log(...str);
